{
  "name": "alight",
  "content": null,
  "children": {
    "science": {
      "name": "science",
      "content": null,
      "children": {
        "biology": {
          "name": "biology",
          "content": null,
          "children": {
            "immunology": {
              "name": "immunology",
              "content": null
            },
            "microbiology": {
              "name": "microbiology",
              "content": null
            },
            "entomology": {
              "name": "entomology",
              "content": null
            }
          }
        },
        "chemistry": {
          "name": "chemistry",
          "content": null,
          "children": {
            "organic": {
              "name": "organic",
              "content": null,
              "children": {
                "elementary_steps": {
                  "name": "elementary_steps",
                  "content": null,
                  "children": {
                    "e1": {
                      "name": "e1",
                      "content": "# E1\n\n## Unimolecular Elimination\n\n----\n\n### Overview\n\n**Unimolecular elimination (E1)** reactions proceed via a two-step mechanism:\n\n1. In the first step, the *leaving group* leaves, yielding a carbocation intermediate, along with the anionic leaving group atom.\n2. In the second step, a Brønsted-Lowry base attacks a hydrogen atom on a neighboring carbon. \n    - When the hydrogen atom is abstracted from the carbocation intermediate, it leaves its only electron behind, as it gains a lone pair from its new parent compound.\n    - The departure of the hdyrogen atom results in the formation of a double carbon-carbon covalent bond."
                    },
                    "e2": {
                      "name": "e2",
                      "content": "# E2\n\n## Bimolecular Elimination\n\n----\n\n### Overview\n\nKarty et al. (2022) explain, \"A **bimolecular elimination (E2)** step is one in which a proton and a leaving group (L) are eliminated from a substrate, resulting in the formation of a new double or triple bond. Like S<sub>N</sub>2 steps, E2 steps are called *bimolecular* because they involve reactant species.\" The authors note, furthermore, that \"an E2 step typically takes place when a strong base reacts with a substrate in which a leaving group (L) and a hydrogen atom are on adjacent carbon atoms.\" That is: \"In an E2 step, the substrate generally has the form H—C—C—L or H—C=C—L, in which the leaving group (L) and the beta (ß) hydrogen are eliminated simultaneously.\"\n\n\"For this reason,\" the authors proceed \"an E2 reaction is a type of *B elimination*,\" which is a reaction in which substituenst on adjacent atoms are eliminated from a molecule, resulting in a new bond between those atoms.\"\n\nFinally, the authors conclude that \"The bsae in an E2 step is the electron-rich species, but the ß hydrogen atom that the base attacks is not particularly electron-porr; instead, the electro-poor atom is the carbon atom bonded to the leaving group (the α carbon). Thus, the flow of electrons from the *electron-rich* site to the *electron-poor* site is depicted with two curved arrows. One curved arrow is drawn from the negatively charged atom in the base to the ß hydrogen in the substrate. The second curved arrow is then drawn from the C—H bond to the bonding region between the α and ß carbon atoms, and the third curved arrow is necessary to depict the departure of L to avoid exceceding the octet on the α on the α carbon. Overall, the electron-poor α carbon atom gains a share of electrons from the C—H bond.\""
                    },
                    "proton_transfer": {
                      "name": "proton_transfer",
                      "content": "# Proton Transfer\n\n----\n\n### Overview\n\nA **proton transfer** is an elementary step in which a proton (H<sup>+</sup>) moves from one molecule (the acid) to another (the base). This process is also known as acid-base reaction or proton exchange.\n\nTo ensure that the proton is not transferred back to the now electron-rich carbanion, organic chemists employ various strategies:\n\n- **Solvent choice**: Selecting a mildly acidic, protic solvent (like water) can be useful for quenching the carbanion's nucleophilicity without interfering with the progression of the target proton transfer."
                    },
                    "sh2": {
                      "name": "sh2",
                      "content": "# S<sub>H</sub>2\n\n## Bimolecular Homolytic Substitution\n\n----\n\n### Overview\n\n**Bimolecular homolytic substitution (S<sub>H</sub>2)** reactions are *elementary steps* in which a radical forms a bond to an atom in a closed-shell species and displaces another radical from that atom (Karty et al., 2022)."
                    },
                    "sn1": {
                      "name": "sn1",
                      "content": "# S<sub>N</sub>1\n\n## Unimolecular Nucleophilic Substitution\n\n----\n\n### Overview\n\n**Unimolecular nucleophilic substitution (S<sub>N</sub>1)** is a two-step sequence consisting of a *heterolysis step* followed by a *coordination step*, in which a leaving group is replaced by a nucleophile:\n\n1. In the first step, the *leaving group (L)* (a good nucleophile) leaves.\n2. In the second step, the nucleophile attacks the electrophilic carbon (i.e., the *electrophile*), forming a new covalent bond."
                    },
                    "sn2": {
                      "name": "sn2",
                      "content": "# S<sub>N</sub>2\n\n## Bimolecular Nucleophilic Substitution\n\n----\n\n\"In a **bimolecular nucleophilic substitution (S<sub>N</sub>2)** step, a molecular species, called a substrate, undergoes *substitution* in which one atom or group of atoms is replaced by another.\n\n\"During the course of the S<sub>N</sub>2 steps ..., a *nucleophile* forms a bond to the substrate at the same time a bond to the *leaving group* (the group that is displaced) is broken. The step is said to be *bimolecular* because it contains two separate reacting species in an elementary step. In other words, the step's [*molecularity*](file://../terminology) is 2. It is called *nucleophilic* simply because the reaction involves a nucleophile as a reactant.\n\n\"... an S<sub>N</sub>2 step is an *elementary step*, meaning that the reactants are converted into products in a *single event*. In other words, the reaction proceeds through a single transition state\" (Karty et al., 2022).\n\n### Generalizations\n\n- Leaving groups are typically *conjugate bases of strong acids*.\n- A **nucleophile** tends to donate a pair of electrons to form a bond to an electron-poor non-hydrogen atom.\n    - Species that act as nucleophiles in S<sub>N</sub>2 steps generally have an atom with the following two features:\n        - A full negative charge or a partial negative charge.\n        - A lone pair of electrons.\n- An **electrophile** is an electron-poor species to which a nucleophile forms a bond.\n- A nucleophile (electron-rich) will tend to form a bond to an electrophile (electron-poor).\n\n### Common Examples\n\n- **Common negatively charged nucleophiles**\n    - HO<sup>-</sup>\n    - CH<sub>3</sub>O<sup>-</sup>\n    - HS<sup>-</sup>\n    - CH<sub>3</sub>S<sup>-</sup>\n    - H<sub>2</sub>N<sup>-</sup>\n    - CH<sub>3</sub>NH<sup>-</sup>\n    - Cl<sup>-</sup>\n    - Br<sup>-</sup>\n    - I<sup>-</sup>\n    - NC<sup>-</sup>\n    - HCC<sup>-</sup>\n    - N<sub>3</sub><sup>-</sup>\n\n- **Common uncharged nucleophiles**\n    - H<sub>3</sub>N\n    - CH<sub>3</sub>NH<sub>2</sub>\n    - H<sub>2</sub>O\n    - CH<sub>3</sub>OH\n    - H<sub>2</sub>S\n    - CH<sub>3</sub>SH"
                    }
                  }
                }
              }
            }
          }
        },
        "physics": {
          "name": "physics",
          "content": null,
          "children": {
            "thermodynamics": {
              "name": "thermodynamics",
              "content": null
            }
          }
        }
      }
    }
  }
}